export default {
	types: {
		"ЛК": "Лекция",
		"ПЗ": "Практическое занятие",
		"ЛР": "Лабораторная работа",
		"Ф": "Факультаив",
	},
	enToRu(text){
		const	dict = {"a":"а","b":"б","v":"в","g":"г","d":"д","e":"э","yo":"ё","zh":"ж","z":"з","i":"и","y":"ы","k":"к","l":"л","m":"м","n":"н","o":"о","p":"п","r":"р","s":"с","t":"т","u":"у","f":"ф","h":"х","c":"ц","ch":"ч","sh":"ш","shch":"щ","":"Ь","yu":"ю","ya":"я","A":"А","B":"Б","V":"В","G":"Г","D":"Д","E":"Э","YO":"Ё","ZH":"Ж","Z":"З","I":"И","Y":"Ы","K":"К","L":"Л","M":"М","N":"Н","O":"О","P":"П","R":"Р","S":"С","T":"Т","U":"У","F":"Ф","H":"Х","C":"Ц","CH":"Ч","SH":"Ш","SHCH":"Щ","YU":"Ю","YA":"Я"};
		const regex = /[A-Z]/i;
		while(text.match(regex)){
			const found = text.match(regex)[0];
			text = text.replace(found, dict[found]);
		}
		return text;
	}
}